
//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永无BUG
//
//                本程序已经经过开光处理，交上OJ就AC！！
//
#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#include<math.h>
int main()
{
    int cas,n,a[1024],cnt,i,k;
    double avr;
    scanf("%d",&cas);
    while(cas--)
    {
        scanf("%d",&n);
        avr=0;
        for(i=0; i<n; i++)
        {
            a[i]=0;
            scanf("%d",&k);
            a[i]=k;
            avr+=k;
        }
        cnt=0;
        avr=avr/n;
        for(i=0; i<n; i++)
        {
            if(a[i]>avr)
                cnt++;
        }
        printf("%.3f%%\n",(double)cnt/n*100);
    }
    return 0;
}
